{
    "version": "https://jsonfeed.org/version/1",
    "title": "Mamawatoto Eco School",
    "description": "",
    "home_page_url": "https://mamawato.now.sh",
    "feed_url": "https://mamawato.now.sh/feed.json",
    "user_comment": "",
    "author": {
        "name": "Mamawatoto"
    },
    "items": [
        {
            "id": "https://mamawato.now.sh/when-training-used-to-be-training.html",
            "url": "https://mamawato.now.sh/when-training-used-to-be-training.html",
            "title": "When Training used to be Training",
            "summary": "We finally attended our training as Art at Heart.We arrived one hour late but were still among the earliest.We found the lady trainer distressed making phone calls to her senior counter-part who had organized the training for her.'There is a big group on the way'&hellip;",
            "content_html": "<p>We finally attended our training as Art at Heart.We arrived one hour late but were still among the earliest.We found the lady trainer distressed making phone calls to her senior counter-part who had organized the training for her.'There is a big group on the way' she was comforted.We tried to encourage the trainer to take it easy and begin the introductions so we can familiarise with each other and flow but she seemed to follow a fixed program where we had to wait until we all  , Slowly and reluctantly people appeared one by one.Two women came with their children it was interesting,</p>\n<p>Ok let me get to my main point.What happened to the good old trainings,A financial training with ILO trained trainers;sponsored by mastercard and equity foundation with no stationery for participants,isnt that poor and disorganized?</p>\n<p>The lady trainer wearing super tight suit with pants showing off all her goods stands up to introduce the training</p>\n<p>\"I don't know the time allocated for this training,I don't know the number of people am expecting,I dont know I don't know ...about four times.</p>\n<p>What happened to the good old sponsored trainings.First as a trainer you would be taken to a five star hotel for a serious two weeks training </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-25T23:33:34-05:00",
            "date_modified": "2019-11-26T00:26:18-05:00"
        },
        {
            "id": "https://mamawato.now.sh/eco-beadwork.html",
            "url": "https://mamawato.now.sh/eco-beadwork.html",
            "title": "Eco Beadwork",
            "summary": "Beadwork is a joy to everyone",
            "content_html": "Beadwork is a joy to everyone",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-10T02:45:02-05:00",
            "date_modified": "2019-11-10T02:45:02-05:00"
        },
        {
            "id": "https://mamawato.now.sh/november-10-2019.html",
            "url": "https://mamawato.now.sh/november-10-2019.html",
            "title": "November 10 2019",
            "summary": "The first radio show program focused on the current work of mamawatoto. Programs described in this episode include plastics pollution abatement and job creation, Green jesus action, food and nutrition education, and MC Teach's work in the school system. ",
            "content_html": "<p>The first radio show program focused on the current work of mamawatoto.</p>\n<p>Programs described in this episode include plastics pollution abatement and job creation, Green jesus action, food and nutrition education, and MC Teach's work in the school system.</p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-10T02:27:19-05:00",
            "date_modified": "2019-11-25T22:41:20-05:00"
        },
        {
            "id": "https://mamawato.now.sh/mamawatoto-radio.html",
            "url": "https://mamawato.now.sh/mamawatoto-radio.html",
            "title": "Mamawatoto Podcast",
            "summary": "We are working toward the launch of radio series emphasizing regular daily affirmations for community action through poetics and rhyme, case studies in ecological restoration, interviews, natural science education, social ventures. Our efforts are woven together with the upliftment of the people of Africa, and&hellip;",
            "content_html": "<p>We are working toward the launch of radio series emphasizing regular daily affirmations for community action through poetics and rhyme, case studies in ecological restoration, interviews, natural science education, social ventures.</p>\n<p>Our efforts are woven together with the upliftment of the people of Africa, and educating one another by reviewing techniques. Buiding a culture of integrity and trist is central to this effort.</p>\n<p>Subjects we are exporing include.</p>\n<p> </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-10T02:11:11-05:00",
            "date_modified": "2019-11-10T02:53:55-05:00"
        },
        {
            "id": "https://mamawato.now.sh/donate.html",
            "url": "https://mamawato.now.sh/donate.html",
            "title": "Donate",
            "summary": "We are partnered with SCDHub, a US non-nonprofit organization allowing donations to our programs to be tax deductable from US businesses and citizens. Dontions directly support the work on the ground that empowers young people and women to live in dignity and have sustainable jobs&hellip;",
            "content_html": "<p>We are partnered with SCDHub, a US non-nonprofit organization allowing donations to our programs to be tax deductable from US businesses and citizens.</p>\n<p>Dontions directly support the work on the ground that empowers young people and women to live in dignity and have sustainable jobs in the communitie.</p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-10T01:44:18-05:00",
            "date_modified": "2019-11-10T01:44:18-05:00"
        },
        {
            "id": "https://mamawato.now.sh/eco-toys.html",
            "url": "https://mamawato.now.sh/eco-toys.html",
            "title": "Eco toys",
            "summary": "African creatives are well known worldwide for designs that excite the mind and spirit. We proudly present our Eco-Toys in keeping with this tradition. ",
            "content_html": "<p>African creatives are well known worldwide for designs that excite the mind and spirit.  </p>\n<p>We proudly present our Eco-Toys in keeping with this tradition.</p>\n<p> </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-09T05:02:22-05:00",
            "date_modified": "2019-11-09T22:59:42-05:00"
        },
        {
            "id": "https://mamawato.now.sh/eco-sandals.html",
            "url": "https://mamawato.now.sh/eco-sandals.html",
            "title": "Eco-sandals",
            "summary": "Eco sandals are made completely from upcycled materials diverted from the modern Kenya's waste stream. Reused belts are used for strapping, repurposed automobile tire treads are used for the soles, washed cloth, beaded ornamentation and glass beading handiwork allow artisans to create the most beautiful&hellip;",
            "content_html": "<p>Eco sandals are made completely from upcycled materials diverted from the modern Kenya's waste stream. Reused belts are used for strapping, repurposed automobile tire treads are used for the soles, washed cloth, beaded ornamentation and glass beading handiwork allow artisans to create the most beautiful and durable products to be found the world over..</p>\n<p>There are several standard designs which work to keep on hand for shipment direct to our customers and donors.  If you have an idea for a design you can make a custom request as well. We appreciate your interest and consideration.</p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-09T04:55:31-05:00",
            "date_modified": "2019-11-09T23:08:16-05:00"
        },
        {
            "id": "https://mamawato.now.sh/eco-handbags.html",
            "url": "https://mamawato.now.sh/eco-handbags.html",
            "title": "Eco-handbags",
            "summary": "Eco-handbags The work of mamaWATOTO is to lead from the grassroots out of poverty. Eco-handbags production provides a path toward self sufficient income for the pickers of plastics in Dandora Dumpsite area of Nairobi. ",
            "content_html": "<p><strong>Eco-handbags </strong></p>\n<p>The work of mamaWATOTO is to lead from the grassroots out of poverty. Eco-handbags production provides a path toward self sufficient income for the pickers of plastics in Dandora Dumpsite area of Nairobi. </p>\n<p> </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-09T04:42:03-05:00",
            "date_modified": "2019-11-09T05:04:17-05:00"
        },
        {
            "id": "https://mamawato.now.sh/eco-products.html",
            "url": "https://mamawato.now.sh/eco-products.html",
            "title": "Eco Products",
            "summary": "Eco handbags We make eco-handbags using waste print film paper.The bags are not only creatively designed but also quite durable. Eco sandals These are sandals created from waste car tyres which if burned cause alot of environmental polution and health risks. Eco toys These are&hellip;",
            "content_html": "<p><strong>Eco handbags</strong></p>\n<p>We make eco-handbags using waste print film paper.The bags are not only creatively designed but also quite durable.</p>\n<p><strong>Eco sandals</strong></p>\n<p>These are sandals created from waste car tyres which if burned cause alot of environmental polution and health risks.</p>\n<p><strong>Eco toys</strong></p>\n<p>These are toys made out of waste materials like cans, jerricans, bottletops and lids.</p>\n<p>The process of making the eco-products is not complicated and can be taught within a couple of hours.</p>\n<p>The goal of Mamawtoto's eco-crafts trainings is to enhance environmetal conservation and create employment to women and young people.  Our work is dedicated to helping the Kenyan government to achieve its vision 2030 and the 17 UN millenium development goals.</p>\n<p> </p>",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-11-08T10:27:24-05:00",
            "date_modified": "2019-11-10T03:11:40-05:00"
        },
        {
            "id": "https://mamawato.now.sh/tet.html",
            "url": "https://mamawato.now.sh/tet.html",
            "title": "what we do",
            "summary": "Eco-Entrepreneurship (Environmental conservation businesses/Green business) We Recycle,Reuse and Reduce polution through making Eco-products,collection of reusable materials and making the most appropriate use of them to prolong their life span.We also train youth and women groups in Eco-entrepreneurship using the -SIYB-ILO business training model. Past Activities In&hellip;",
            "content_html": "<p><strong>Eco-Entrepreneurship (Environmental conservation businesses/Green business)</strong> We Recycle,Reuse and Reduce polution through making Eco-products,collection of reusable materials and making the most appropriate use of them to prolong their life span.We also train youth and women groups in Eco-entrepreneurship using the -SIYB-ILO business training model.</p>\n<p><strong>Past Activities</strong></p>\n<p>In 2013 we trained women and youth groups in Kitui, Busia and Kilifi under the ILO-SNAP IPEC program creating over 150 jobs in business planning and eco-product creation namely: <a href=\"#INTERNAL_LINK#/post/4\">Eco-sandals</a>, <a href=\"#INTERNAL_LINK#/post/3\">Eco-bags</a> and Eco-beadwork.</p>",
            "image": "https://mamawato.now.sh/media/posts/1/moneyflo1.png",
            "author": {
                "name": "Mamawatoto"
            },
            "tags": [
            ],
            "date_published": "2019-10-05T13:01:35-04:00",
            "date_modified": "2019-11-10T02:44:19-05:00"
        }
    ]
}
